Revit 2024 API
Connector.Utility Property
 Indicates if the connector is a utility connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public bool Utility { get; }
Visual Basic
Public ReadOnly Property Utility As Boolean
	Get
Visual C++
public:
property bool Utility {
	bool get ();
}
See Also
Connector Class
Autodesk.Revit.DB Namespace